# Will we get a White Christmas in Transylvania in 2020?

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
%matplotlib inline
pd.pandas.set_option('display.max_columns', None)

In [2]:
df = pd.read_excel("Transylvania_Christmas_Wheather.xlsx")
df.head()

             NAME       DATE  PRCP  TAVG  TMAX  TMIN
0  CLUJ NAPOCA RO 1950-12-01   4.3   NaN   7.9   1.6
1  CLUJ NAPOCA RO 1950-12-02   0.0   NaN   2.7  -1.2
2  CLUJ NAPOCA RO 1950-12-03   0.0   NaN   0.4  -3.0
3  CLUJ NAPOCA RO 1950-12-04   0.0   NaN   1.3  -3.2
4  CLUJ NAPOCA RO 1950-12-05   3.3   NaN   7.0  -0.3

In [3]:
df.dtypes

NAME            object
DATE    datetime64[ns]
PRCP           float64
TAVG           float64
TMAX           float64
TMIN           float64
dtype: object

In [4]:
df.shape

(68815, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68815 entries, 0 to 68814
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    68815 non-null  object
 1   DATE    68815 non-null  datetime64[ns]
 2   PRCP    68397 non-null  float64
 3   TAVG    39406 non-null  float64
 4   TMAX    68705 non-null  float64
 5   TMIN    68655 non-null  float64
dtypes: datetime64[ns](1), float64(4), object(1)
memory usage: 3.2+ MB

In [6]:
df.describe()

               PRCP          TAVG          TMAX          TMIN
count  68397.000000  39406.000000  68705.000000  68655.000000
mean       1.636538      9.026176     15.153561      4.261601
std        4.388025      9.005401     10.215610      8.076367
min        0.000000    -27.100000    -20.400000    -34.200000
25%        0.000000      1.900000      6.500000     -1.300000
50%        0.000000      9.900000     16.400000      5.000000
75%        1.000000     16.600000     23.600000     10.900000
max       81.600000     30.000000     40.000000     25.500000

In [10]:
df = df[(df['DATE'].dt.month == 12)]

In [13]:
df.head(-40)

                 NAME       DATE  PRCP  TAVG  TMAX  TMIN
0      CLUJ NAPOCA RO 1950-12-01   4.3   NaN   7.9   1.6
1      CLUJ NAPOCA RO 1950-12-02   0.0   NaN   2.7  -1.2
2      CLUJ NAPOCA RO 1950-12-03   0.0   NaN   0.4  -3.0
3      CLUJ NAPOCA RO 1950-12-04   0.0   NaN   1.3  -3.2
4      CLUJ NAPOCA RO 1950-12-05   3.3   NaN   7.0  -0.3
...               ...        ...   ...   ...   ...   ...
68436        SIBIU RO 2018-12-18  11.7  -1.6   0.8  -2.1
68437        SIBIU RO 2018-12-19   0.1  -2.1  -0.4  -2.9
68438        SIBIU RO 2018-12-20   0.0  -2.3  -0.7  -2.8
68439        SIBIU RO 2018-12-21   0.0  -3.8   1.1  -5.8
68440        SIBIU RO 2018-12-22   0.0   2.7   8.9  -7.5

[5829 rows x 6 columns]

In [15]:
df.head(-1)

                 NAME       DATE  PRCP  TAVG  TMAX  TMIN
0      CLUJ NAPOCA RO 1950-12-01   4.3   NaN   7.9   1.6
1      CLUJ NAPOCA RO 1950-12-02   0.0   NaN   2.7  -1.2
2      CLUJ NAPOCA RO 1950-12-03   0.0   NaN   0.4  -3.0
3      CLUJ NAPOCA RO 1950-12-04   0.0   NaN   1.3  -3.2
4      CLUJ NAPOCA RO 1950-12-05   3.3   NaN   7.0  -0.3
...               ...        ...   ...   ...   ...   ...
68809        SIBIU RO 2019-12-26   2.3   1.9   3.6   0.4
68810        SIBIU RO 2019-12-27   0.0   1.8   5.3  -0.8
68811        SIBIU RO 2019-12-28   2.8  -0.3   1.3  -1.3
68812        SIBIU RO 2019-12-29   4.7  -2.6  -0.3  -3.2
68813        SIBIU RO 2019-12-30   0.0  -5.7   0.6  -8.8

[5868 rows x 6 columns]

In [14]:
df.shape

(5869, 6)

In [16]:
df.reset_index(drop=True, inplace=True)

In [17]:
df.head(-1)

                NAME       DATE  PRCP  TAVG  TMAX  TMIN
0     CLUJ NAPOCA RO 1950-12-01   4.3   NaN   7.9   1.6
1     CLUJ NAPOCA RO 1950-12-02   0.0   NaN   2.7  -1.2
2     CLUJ NAPOCA RO 1950-12-03   0.0   NaN   0.4  -3.0
3     CLUJ NAPOCA RO 1950-12-04   0.0   NaN   1.3  -3.2
4     CLUJ NAPOCA RO 1950-12-05   3.3   NaN   7.0  -0.3
...              ...        ...   ...   ...   ...   ...
5863        SIBIU RO 2019-12-26   2.3   1.9   3.6   0.4
5864        SIBIU RO 2019-12-27   0.0   1.8   5.3  -0.8
5865        SIBIU RO 2019-12-28   2.8  -0.3   1.3  -1.3
5866        SIBIU RO 2019-12-29   4.7  -2.6  -0.3  -3.2
5867        SIBIU RO 2019-12-30   0.0  -5.7   0.6  -8.8

[5868 rows x 6 columns]

In [18]:
df = df[(df['DATE'].dt.day == 23) | (df['DATE'].dt.day == 24) | (df['DATE'].dt.day == 25)]

In [19]:
df.head(-40)

                NAME       DATE  PRCP  TAVG  TMAX  TMIN
22    CLUJ NAPOCA RO 1950-12-23   0.0   NaN   4.0  -2.4
23    CLUJ NAPOCA RO 1950-12-24   0.0   NaN   7.0   0.8
24    CLUJ NAPOCA RO 1950-12-25   0.0   NaN   9.3  -0.1
53    CLUJ NAPOCA RO 1951-12-23   0.0   NaN  -7.8 -12.1
54    CLUJ NAPOCA RO 1951-12-24   0.0   NaN  -6.5 -10.0
...              ...        ...   ...   ...   ...   ...
5426        SIBIU RO 2005-12-23   4.8  -3.8  -2.6  -5.5
5427        SIBIU RO 2005-12-24   1.1  -2.8  -0.4  -4.8
5428        SIBIU RO 2005-12-25   0.2   1.0   4.5  -2.3
5457        SIBIU RO 2006-12-23   0.0   1.8   4.8  -0.6
5458        SIBIU RO 2006-12-24   0.0   0.8   2.2   0.4

[526 rows x 6 columns]

In [20]:
df.head(-1)

                NAME       DATE  PRCP  TAVG  TMAX  TMIN
22    CLUJ NAPOCA RO 1950-12-23   0.0   NaN   4.0  -2.4
23    CLUJ NAPOCA RO 1950-12-24   0.0   NaN   7.0   0.8
24    CLUJ NAPOCA RO 1950-12-25   0.0   NaN   9.3  -0.1
53    CLUJ NAPOCA RO 1951-12-23   0.0   NaN  -7.8 -12.1
54    CLUJ NAPOCA RO 1951-12-24   0.0   NaN  -6.5 -10.0
...              ...        ...   ...   ...   ...   ...
5829        SIBIU RO 2018-12-23   0.1   5.9   8.5   3.2
5830        SIBIU RO 2018-12-24   9.8   2.8   7.1   0.9
5831        SIBIU RO 2018-12-25   0.3  -1.0   3.1  -2.3
5860        SIBIU RO 2019-12-23   3.8   7.4  13.2   5.2
5861        SIBIU RO 2019-12-24   7.0   3.7   5.4   2.8

[565 rows x 6 columns]

In [21]:
df.reset_index(drop=True, inplace=True)

In [22]:
df.shape

(566, 6)

In [23]:
df.head(-1)

               NAME       DATE  PRCP  TAVG  TMAX  TMIN
0    CLUJ NAPOCA RO 1950-12-23   0.0   NaN   4.0  -2.4
1    CLUJ NAPOCA RO 1950-12-24   0.0   NaN   7.0   0.8
2    CLUJ NAPOCA RO 1950-12-25   0.0   NaN   9.3  -0.1
3    CLUJ NAPOCA RO 1951-12-23   0.0   NaN  -7.8 -12.1
4    CLUJ NAPOCA RO 1951-12-24   0.0   NaN  -6.5 -10.0
..              ...        ...   ...   ...   ...   ...
560        SIBIU RO 2018-12-23   0.1   5.9   8.5   3.2
561        SIBIU RO 2018-12-24   9.8   2.8   7.1   0.9
562        SIBIU RO 2018-12-25   0.3  -1.0   3.1  -2.3
563        SIBIU RO 2019-12-23   3.8   7.4  13.2   5.2
564        SIBIU RO 2019-12-24   7.0   3.7   5.4   2.8

[565 rows x 6 columns]

In [26]:
df.isnull().sum()

NAME      0
DATE      0
PRCP      0
TAVG    241
TMAX      0
TMIN      1
dtype: int64

In [36]:
df[df['TMIN'].isnull()].index.tolist()

[388]

In [39]:
print(df.loc[[388]])

         NAME       DATE  PRCP  TAVG  TMAX  TMIN
388  SIBIU RO 1953-12-24   1.5  -4.0  -2.2   NaN

In [40]:
df['TAVG'] = df.apply(
    lambda row: (row['TMAX']+row['TMIN'])/2 if np.isnan(row['TAVG']) else row['TAVG'],
    axis=1
)

In [41]:
df.head(-1)

               NAME       DATE  PRCP  TAVG  TMAX  TMIN
0    CLUJ NAPOCA RO 1950-12-23   0.0  0.80   4.0  -2.4
1    CLUJ NAPOCA RO 1950-12-24   0.0  3.90   7.0   0.8
2    CLUJ NAPOCA RO 1950-12-25   0.0  4.60   9.3  -0.1
3    CLUJ NAPOCA RO 1951-12-23   0.0 -9.95  -7.8 -12.1
4    CLUJ NAPOCA RO 1951-12-24   0.0 -8.25  -6.5 -10.0
..              ...        ...   ...   ...   ...   ...
560        SIBIU RO 2018-12-23   0.1  5.90   8.5   3.2
561        SIBIU RO 2018-12-24   9.8  2.80   7.1   0.9
562        SIBIU RO 2018-12-25   0.3 -1.00   3.1  -2.3
563        SIBIU RO 2019-12-23   3.8  7.40  13.2   5.2
564        SIBIU RO 2019-12-24   7.0  3.70   5.4   2.8

[565 rows x 6 columns]

In [42]:
df.isnull().sum()

NAME    0
DATE    0
PRCP    0
TAVG    0
TMAX    0
TMIN    1
dtype: int64

In [43]:
 df.drop(columns =['TMAX', 'TMIN'])

               NAME       DATE  PRCP  TAVG
0    CLUJ NAPOCA RO 1950-12-23   0.0  0.80
1    CLUJ NAPOCA RO 1950-12-24   0.0  3.90
2    CLUJ NAPOCA RO 1950-12-25   0.0  4.60
3    CLUJ NAPOCA RO 1951-12-23   0.0 -9.95
4    CLUJ NAPOCA RO 1951-12-24   0.0 -8.25
..              ...        ...   ...   ...
561        SIBIU RO 2018-12-24   9.8  2.80
562        SIBIU RO 2018-12-25   0.3 -1.00
563        SIBIU RO 2019-12-23   3.8  7.40
564        SIBIU RO 2019-12-24   7.0  3.70
565        SIBIU RO 2019-12-25   0.0  3.10

[566 rows x 4 columns]